@dannyk81  Is this Helps for your Issue. ?

```

root@terraformclient:~/Go_Workspace/src/github.com/terraform-providers/terraform-provider-bigip# cat route_domain.tf
provider "bigip" {
  address = "10.145.67.133"
  username = "admin"
  password = "F5site02"
}

resource "bigip_ltm_pool" "wild-pool" {
        name = "/Common/test-pool"
        load_balancing_mode = "round-robin"
        allow_snat = "yes"
        allow_nat = "yes"
}
resource "bigip_ltm_node" "ltm-node" {
  name = "/Common/webservice"
  address = "172.17.240.182%2"
  connection_limit = "0"
  dynamic_ratio = "1"
  monitor = "default"
  rate_limit = "disabled"
}

resource "bigip_ltm_pool_attachment" "attach-node" {
        pool = "${bigip_ltm_pool.wild-pool.name}"
        node ="${bigip_ltm_node.ltm-node.name}:0"
}

resource "bigip_ltm_policy" "http_to_https_redirect" {
  name = "http_to_https_redirect"
  strategy = "/Common/first-match"
  requires = ["http"]
  published_copy = "Drafts/http_to_https_redirect"
  controls = ["forwarding"]
  rule  {
    name = "http_to_https_redirect_rule"
    action {
      tm_name = "http_to_https_redirect2"
      redirect = true
      location = "tcl:https://[HTTP::host][HTTP::uri]"
      http_reply = true
    }
  }
}

root@terraformclient:~/Go_Workspace/src/github.com/terraform-providers/terraform-provider-bigip# terraform init

Initializing the backend...

Initializing provider plugins...

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
root@terraformclient:~/Go_Workspace/src/github.com/terraform-providers/terraform-provider-bigip# terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # bigip_ltm_node.ltm-node will be created
  + resource "bigip_ltm_node" "ltm-node" {
      + address          = "172.17.240.182%2"
      + connection_limit = 0
      + dynamic_ratio    = 1
      + id               = (known after apply)
      + monitor          = "default"
      + name             = "/Common/webservice"
      + rate_limit       = "disabled"
      + state            = (known after apply)
    }

  # bigip_ltm_policy.http_to_https_redirect will be created
  + resource "bigip_ltm_policy" "http_to_https_redirect" {
      + controls       = [
          + "forwarding",
        ]
      + id             = (known after apply)
      + name           = "http_to_https_redirect"
      + published_copy = "Drafts/http_to_https_redirect"
      + requires       = [
          + "http",
        ]
      + strategy       = "/Common/first-match"

      + rule {
          + name = "http_to_https_redirect_rule"

          + action {
              + app_service          = (known after apply)
              + application          = (known after apply)
              + asm                  = (known after apply)
              + avr                  = (known after apply)
              + cache                = (known after apply)
              + carp                 = (known after apply)
              + category             = (known after apply)
              + classify             = (known after apply)
              + clone_pool           = (known after apply)
              + code                 = (known after apply)
              + compress             = (known after apply)
              + content              = (known after apply)
              + cookie_hash          = (known after apply)
              + cookie_insert        = (known after apply)
              + cookie_passive       = (known after apply)
              + cookie_rewrite       = (known after apply)
              + decompress           = (known after apply)
              + defer                = (known after apply)
              + destination_address  = (known after apply)
              + disable              = (known after apply)
              + domain               = (known after apply)
              + enable               = (known after apply)
              + expiry               = (known after apply)
              + expiry_secs          = (known after apply)
              + expression           = (known after apply)
              + extension            = (known after apply)
              + facility             = (known after apply)
              + forward              = (known after apply)
              + from_profile         = (known after apply)
              + hash                 = (known after apply)
              + host                 = (known after apply)
              + http                 = (known after apply)
              + http_basic_auth      = (known after apply)
              + http_cookie          = (known after apply)
              + http_header          = (known after apply)
              + http_referer         = (known after apply)
              + http_reply           = true
              + http_set_cookie      = (known after apply)
              + http_uri             = (known after apply)
              + ifile                = (known after apply)
              + insert               = (known after apply)
              + internal_virtual     = (known after apply)
              + ip_address           = (known after apply)
              + key                  = (known after apply)
              + l7dos                = (known after apply)
              + length               = (known after apply)
              + location             = "tcl:https://[HTTP::host][HTTP::uri]"
              + log                  = (known after apply)
              + ltm_policy           = (known after apply)
              + member               = (known after apply)
              + message              = (known after apply)
              + netmask              = (known after apply)
              + nexthop              = (known after apply)
              + node                 = (known after apply)
              + offset               = (known after apply)
              + path                 = (known after apply)
              + pem                  = (known after apply)
              + persist              = (known after apply)
              + pin                  = (known after apply)
              + policy               = (known after apply)
              + pool                 = (known after apply)
              + port                 = (known after apply)
              + priority             = (known after apply)
              + profile              = (known after apply)
              + protocol             = (known after apply)
              + query_string         = (known after apply)
              + rateclass            = (known after apply)
              + redirect             = true
              + remove               = (known after apply)
              + replace              = (known after apply)
              + request              = (known after apply)
              + request_adapt        = (known after apply)
              + reset                = (known after apply)
              + response             = (known after apply)
              + response_adapt       = (known after apply)
              + scheme               = (known after apply)
              + script               = (known after apply)
              + select               = (known after apply)
              + server_ssl           = (known after apply)
              + set_variable         = (known after apply)
              + snat                 = (known after apply)
              + snatpool             = (known after apply)
              + source_address       = (known after apply)
              + ssl_client_hello     = (known after apply)
              + ssl_server_handshake = (known after apply)
              + ssl_server_hello     = (known after apply)
              + ssl_session_id       = (known after apply)
              + status               = (known after apply)
              + tcl                  = (known after apply)
              + tcp_nagle            = (known after apply)
              + text                 = (known after apply)
              + timeout              = (known after apply)
              + tm_name              = "http_to_https_redirect2"
              + uie                  = (known after apply)
              + universal            = (known after apply)
              + value                = (known after apply)
              + virtual              = (known after apply)
              + vlan                 = (known after apply)
              + vlan_id              = (known after apply)
              + wam                  = (known after apply)
              + write                = (known after apply)
            }
        }
    }

  # bigip_ltm_pool.wild-pool will be created
  + resource "bigip_ltm_pool" "wild-pool" {
      + allow_nat           = "yes"
      + allow_snat          = "yes"
      + id                  = (known after apply)
      + load_balancing_mode = "round-robin"
      + monitors            = (known after apply)
      + name                = "/Common/test-pool"
      + reselect_tries      = (known after apply)
      + service_down_action = (known after apply)
      + slow_ramp_time      = (known after apply)
    }

  # bigip_ltm_pool_attachment.attach-node will be created
  + resource "bigip_ltm_pool_attachment" "attach-node" {
      + id   = (known after apply)
      + node = "/Common/webservice:0"
      + pool = "/Common/test-pool"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

bigip_ltm_node.ltm-node: Creating...
bigip_ltm_pool.wild-pool: Creating...
bigip_ltm_policy.http_to_https_redirect: Creating...
bigip_ltm_node.ltm-node: Creation complete after 0s [id=/Common/webservice]
bigip_ltm_pool.wild-pool: Creation complete after 0s [id=/Common/test-pool]
bigip_ltm_pool_attachment.attach-node: Creating...
bigip_ltm_policy.http_to_https_redirect: Creation complete after 0s [id=http_to_https_redirect]
bigip_ltm_pool_attachment.attach-node: Creation complete after 0s [id=/Common/test-pool-/Common/webservice:0]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.
root@terraformclient:~/Go_Workspace/src/github.com/terraform-providers/terraform-provider-bigip# terraform show
# bigip_ltm_node.ltm-node:
resource "bigip_ltm_node" "ltm-node" {
    address          = "172.17.240.182%2"
    connection_limit = 0
    dynamic_ratio    = 1
    id               = "/Common/webservice"
    monitor          = "default"
    name             = "/Common/webservice"
    rate_limit       = "disabled"
    state            = "unchecked"
}

# bigip_ltm_policy.http_to_https_redirect:
resource "bigip_ltm_policy" "http_to_https_redirect" {
    controls       = [
        "forwarding",
    ]
    id             = "http_to_https_redirect"
    name           = "http_to_https_redirect"
    published_copy = "Drafts/http_to_https_redirect"
    requires       = [
        "http",
    ]
    strategy       = "/Common/first-match"

    rule {
        name = "http_to_https_redirect_rule"

        action {
            asm                  = false
            avr                  = false
            cache                = false
            carp                 = false
            classify             = false
            code                 = 0
            compress             = false
            cookie_hash          = false
            cookie_insert        = false
            cookie_passive       = false
            cookie_rewrite       = false
            decompress           = false
            defer                = false
            destination_address  = false
            disable              = false
            enable               = false
            expiry_secs          = 0
            forward              = false
            hash                 = false
            http                 = false
            http_basic_auth      = false
            http_cookie          = false
            http_header          = false
            http_host            = false
            http_referer         = false
            http_reply           = true
            http_set_cookie      = false
            http_uri             = false
            insert               = false
            l7dos                = false
            length               = 0
            location             = "tcl:https://[HTTP::host][HTTP::uri]"
            log                  = false
            ltm_policy           = false
            offset               = 0
            pem                  = false
            persist              = false
            pin                  = false
            port                 = 0
            redirect             = true
            remove               = false
            replace              = false
            request              = false
            request_adapt        = false
            reset                = false
            response             = false
            response_adapt       = false
            select               = false
            server_ssl           = false
            set_variable         = false
            source_address       = false
            ssl_client_hello     = false
            ssl_server_handshake = false
            ssl_server_hello     = false
            ssl_session_id       = false
            status               = 0
            tcl                  = false
            tcp_nagle            = false
            timeout              = 0
            tm_name              = "http_to_https_redirect2"
            uie                  = false
            universal            = false
            vlan_id              = 0
            wam                  = false
            write                = false
        }
    }
}

# bigip_ltm_pool.wild-pool:
resource "bigip_ltm_pool" "wild-pool" {
    allow_nat           = "yes"
    allow_snat          = "yes"
    id                  = "/Common/test-pool"
    load_balancing_mode = "round-robin"
    monitors            = [
        "",
    ]
    name                = "/Common/test-pool"
    reselect_tries      = 0
    service_down_action = "none"
    slow_ramp_time      = 0
}

# bigip_ltm_pool_attachment.attach-node:
resource "bigip_ltm_pool_attachment" "attach-node" {
    id   = "/Common/test-pool-/Common/webservice:0"
    node = "/Common/webservice:0"
    pool = "/Common/test-pool"
}


root@terraformclient:~/Go_Workspace/src/github.com/terraform-providers/terraform-provider-bigip# terraform apply
bigip_ltm_node.ltm-node: Refreshing state... [id=/Common/webservice]
bigip_ltm_policy.http_to_https_redirect: Refreshing state... [id=http_to_https_redirect]
bigip_ltm_pool.wild-pool: Refreshing state... [id=/Common/test-pool]
bigip_ltm_pool_attachment.attach-node: Refreshing state... [id=/Common/test-pool-/Common/webservice:0]

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.

```
